extends Control

# ==============================================================================
# INITIALIZATION LIFE CYCLE
# - สั่งปลดขอบเขตของระดับอินพุตของระบบเพื่อให้เมาส์กลับมาแสดงผลได้อย่างสมบูรณ์ป้องกันปัญหาเคอร์เซอร์หาย
# ==============================================================================
func _ready():
	# UI Safety Check: แสดงผลเคอร์เซอร์ของเมาส์ในระบบจำลองเพื่อความพร้อมของผู้ใช้
	Input.set_mouse_mode(Input.MOUSE_MODE_VISIBLE)

# ==============================================================================
# EVENT HANDLER: SYSTEM REBOOT (SCENE TRANSITION)
# - ทำการสับค่าสถานะความสำเร็จในหน่วยความจำชั่วคราวให้เป็นศูนย์เพื่อล้างการสะสมเดิม
# - เปลี่ยนทรานสิชันไปยังฉากการคัดเลือกโหมดหลักแบบไร้การสะดุด
# ==============================================================================
func _on_restart_button_pressed() -> void:
	# Memory Cleanup: รีเซ็ตข้อมูลด่านที่เคลียร์ไว้ใน Global Singleton เป็นศูนย์
	Global.completed_modules_count = 0
	
	# Scene Switcher: เปลี่ยนฉากไปยังระบบเลือกโหมดการทดสอบจำลองอย่างปลอดภัย
	get_tree().change_scene_to_file("res://mode_selection.tscn")
